[Demo_Ekoro_End_normal_ENG GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-490,Y=1114,Z=1335),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=342,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=-300,Y=1055,Z=1200),VecSub=(X=165,Y=0,Z=0),CId=71)
DemoScripts[4]=(Actor=CHARACTER,Command=POP,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',Vec=(X=-300,Y=1170,Z=1200),VecSub=(X=210,Y=0,Z=0),CId=21)
DemoScripts[5]=(Actor=CHARACTER,Command=POP,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',Vec=(X=-310,Y=1220,Z=1200),VecSub=(X=165,Y=0,Z=0),CId=72)
DemoScripts[6]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[7]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0202_lp_half_perplex",motionName[1]="ek_CM_0001_fx_close_down",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[8]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0000_lp_open_normal",motionName[1]="pt_CM_0002_fx_close_smile_S",motionName[2]="pt_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[9]=(Actor=CHARACTER,Command=ACTION,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',motionName[0]="kr_CE_0400_lp_disgusted",motionName[1]="kr_CM_0001_fx_close_down",motionName[2]="kr_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[10]=(Actor=CHARACTER,Command=PARAM,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',Number=11,Vec=(X=-400,Y=1210,Z=1340))
DemoScripts[11]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_End_Ekoro.GG2_BGM_DM_End_Ekoro_Cue')
DemoScripts[12]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Rooftop.GG2_AMB_Rooftop_LP_Cue')
DemoScripts[13]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[14]=(Actor=FADE,Command=WAIT)
DemoScripts[15]=(Actor=WINDOW,Command=SET)
DemoScripts[16]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[17]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0002_lp_open_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[18]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0113_fx_Stand2Depressed",Rate=1,Number=2,Bit=0)
DemoScripts[19]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1300_lp_Depressed",Number=8)
DemoScripts[20]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_002_Cue',Name="エコロ")
DemoScripts[21]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[22]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[23]=(Actor=WINDOW,Command=EXIT)
DemoScripts[24]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1301_fx_Depressed2Stand",Rate=1,Number=2,Bit=0)
DemoScripts[25]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[26]=(Actor=CAMERA,Command=MOVE,SetType=POS,Vec=(X=-510,Y=1114,Z=1335),SecTime=0.5)
DemoScripts[27]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=356,Y=-5,Z=0),SecTime=0.5)
DemoScripts[28]=(Actor=CHARACTER,Command=MOVE,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',SetType=ROT,Vec=(X=135,Y=0,Z=0),SecTime=0.5,CId=71)
DemoScripts[29]=(Actor=CHARACTER,Command=MOVE,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',SetType=POS,Vec=(X=-295,Y=1145,Z=1200),SecTime=0.5,CId=21)
DemoScripts[30]=(Actor=SYSTEM,Command=WAIT,SecTime=0.5)
DemoScripts[31]=(Actor=CHARACTER,Command=SET,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',SetType=POS,Vec=(X=-295,Y=1145,Z=1200),CId=21)
DemoScripts[32]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-510,Y=1114,Z=1335),SecTime=)
DemoScripts[33]=(Actor=WINDOW,Command=SET)
DemoScripts[34]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_003_Cue',Name="エコロ")
DemoScripts[35]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[36]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[37]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[38]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_005_Cue',Name="アマツカ　パタコ")
DemoScripts[39]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[40]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[41]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0101_fx_close_smile",Rate=0,Number=0,Bit=0)
DemoScripts[42]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[2]="pt_DM_0107_fx_Stand2Proud",Rate=1,Number=2,Bit=0)
DemoScripts[43]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[2]="pt_DM_0700_lp_Proud",Number=8)
DemoScripts[44]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_006_Cue',Name="アマツカ　パタコ")
DemoScripts[45]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[46]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[47]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0003_lp_open_surprise",Rate=0,Number=0,Bit=1)
DemoScripts[48]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0000_fx_close_normal",Rate=1,Number=1,Bit=0)
DemoScripts[49]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_007_Cue',Name="エコロ")
DemoScripts[50]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[51]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[52]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_008_Cue',Name="エコロ")
DemoScripts[53]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[54]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[55]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0000_lp_open_normal",Rate=0,Number=0,Bit=1)
DemoScripts[56]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[2]="pt_DM_0701_fx_Proud2Stand",Rate=1,Number=2,Bit=0)
DemoScripts[57]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[2]="pt_DM_0100_lp_Stand",Number=8)
DemoScripts[58]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_009_Cue',Name="アマツカ　パタコ")
DemoScripts[59]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[60]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[61]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[2]="pt_DM_0102_fx_Stand2Expound",Rate=1,Number=2,Bit=0)
DemoScripts[62]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[2]="pt_DM_0200_lp_Expound",Number=8)
DemoScripts[63]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_010_Cue',Name="アマツカ　パタコ")
DemoScripts[64]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[65]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[66]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0002_lp_open_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[67]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0001_fx_close_down",Rate=1,Number=1,Bit=0)
DemoScripts[68]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[2]="pt_DM_0201_fx_Expound2Stand",Rate=1,Number=2,Bit=0)
DemoScripts[69]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[2]="pt_DM_0100_lp_Stand",Number=8)
DemoScripts[70]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_011_Cue',Name="エコロ")
DemoScripts[71]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[72]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[73]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0202_lp_half_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[74]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[2]="pt_DM_0103_fx_Stand2Inarticulately",Rate=1,Number=2,Bit=0)
DemoScripts[75]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[2]="pt_DM_0300_lp_Inarticulately",Number=8)
DemoScripts[76]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_012_Cue',Name="アマツカ　パタコ")
DemoScripts[77]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[78]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[79]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0003_lp_open_surprise",Rate=0,Number=0,Bit=1)
DemoScripts[80]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0000_fx_close_normal",Rate=1,Number=1,Bit=0)
DemoScripts[81]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_013_Cue',Name="エコロ")
DemoScripts[82]=(Actor=TEXT,Command=SET,ID=TEXT13)
DemoScripts[83]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[84]=(Actor=BGM,Command=STOP,SecTime=1,SoundID=)
DemoScripts[85]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[86]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_Usual_Others.GG2_BGM_DM_Usual_Others_Cue')
DemoScripts[87]=(Actor=CHARACTER,Command=PARAM,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',Number=13,Bit=0,Rate=1)
DemoScripts[88]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0002_lp_open_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[89]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[2]="pt_DM_0301_fx_Inarticulately2Stand",Rate=1,Number=2,Bit=0)
DemoScripts[90]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[2]="pt_DM_0100_lp_Stand",Number=8)
DemoScripts[91]=(Actor=CHARACTER,Command=CHEEK,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',Rate=0.8,Number=)
DemoScripts[92]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_014_Cue',Name="アマツカ　パタコ")
DemoScripts[93]=(Actor=TEXT,Command=SET,ID=TEXT14)
DemoScripts[94]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[95]=(Actor=WINDOW,Command=EXIT)
DemoScripts[96]=(Actor=FADE,Command=SET,SecTime=0.3,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_BACK)
DemoScripts[97]=(Actor=FADE,Command=WAIT)
DemoScripts[98]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0101_fx_close_smile",Rate=1,Number=0,Bit=0)
DemoScripts[99]=(Actor=CHARACTER,Command=PARAM,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',Number=13,Bit=0,Rate=1)
DemoScripts[100]=(Actor=CHARACTER,Command=SET,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',SetType=POS,Vec=(X=-420,Y=1120,Z=1145),CId=21)
DemoScripts[101]=(Actor=CHARACTER,Command=SET,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',SetType=ROT,Vec=(X=180,Y=0,Z=0),CId=21)
DemoScripts[102]=(Actor=FADE,Command=EXIT,SecTime=0.3,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_BACK)
DemoScripts[103]=(Actor=FADE,Command=WAIT)
DemoScripts[104]=(Actor=CHARACTER,Command=PARAM,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Number=13,Bit=0,Rate=1)
DemoScripts[105]=(Actor=CAMERA,Command=SHAKE,ShakeLevel=LEVEL_2,SecTime=1)
DemoScripts[106]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_DM_Hug_Cue')
DemoScripts[107]=(Actor=CAMERA,Command=MOVE,SetType=POS,Vec=(X=-520,Y=1114,Z=1260),SecTime=0.3)
DemoScripts[108]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=356,Y=12,Z=0),SecTime=0.3)
DemoScripts[109]=(Actor=SYSTEM,Command=WAIT,SecTime=0.3)
DemoScripts[110]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-520,Y=1114,Z=1260),SecTime=)
DemoScripts[111]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_DM_Fall_Down_Cue')
DemoScripts[112]=(Actor=WINDOW,Command=SET)
DemoScripts[113]=(Actor=TEXT,Command=SET,ID=TEXT15)
DemoScripts[114]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0000_fx_close_normal",Rate=1,Number=1,Bit=0)
DemoScripts[115]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0103_fx_Stand2Furry",Rate=1,Number=2,Bit=0)
DemoScripts[116]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0300_lp_Furry",Number=8)
DemoScripts[117]=(Actor=EMOTION,Command=SET,Name="エコロ",Number=1,CId=71)
DemoScripts[118]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_Manpu_Pressure_Cue')
DemoScripts[119]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_016_Cue',Name="エコロ")
DemoScripts[120]=(Actor=TEXT,Command=SET,ID=TEXT16)
DemoScripts[121]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[122]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",Rate=0,Number=0,Bit=1)
DemoScripts[123]=(Actor=CHARACTER,Command=PARAM,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Number=13,Bit=0,Rate=0)
DemoScripts[124]=(Actor=CHARACTER,Command=PARAM,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Number=4,Vec=(X=-280,Y=1150,Z=1320))
DemoScripts[125]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0301_fx_Furry2Stand",Rate=1,Number=2,Bit=0)
DemoScripts[126]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[127]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_017_Cue',Name="エコロ")
DemoScripts[128]=(Actor=TEXT,Command=SET,ID=TEXT17)
DemoScripts[129]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[130]=(Actor=WINDOW,Command=EXIT)
DemoScripts[131]=(Actor=CHARACTER,Command=MOVE,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',SetType=POS,Vec=(X=-476,Y=1105,Z=1115),SecTime=0.5,CId=21)
DemoScripts[132]=(Actor=CAMERA,Command=SHAKE,ShakeLevel=LEVEL_1,SecTime=1)
DemoScripts[133]=(Actor=CAMERA,Command=MOVE,SetType=POS,Vec=(X=-576,Y=1088,Z=1260),SecTime=0.5)
DemoScripts[134]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=8,Y=10,Z=0),SecTime=0.5)
DemoScripts[135]=(Actor=CHARACTER,Command=MOVE,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',SetType=POS,Vec=(X=-310,Y=1200,Z=1200),SecTime=0.5,CId=72)
DemoScripts[136]=(Actor=SYSTEM,Command=WAIT,SecTime=0.5)
DemoScripts[137]=(Actor=CHARACTER,Command=SET,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',SetType=POS,Vec=(X=-310,Y=1200,Z=1200),CId=72)
DemoScripts[138]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-576,Y=1088,Z=1260),SecTime=)
DemoScripts[139]=(Actor=CHARACTER,Command=SET,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',SetType=POS,Vec=(X=-476,Y=1105,Z=1115),CId=21)
DemoScripts[140]=(Actor=WINDOW,Command=SET)
DemoScripts[141]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_018_Cue',Name="クロナ")
DemoScripts[142]=(Actor=TEXT,Command=SET,ID=TEXT18)
DemoScripts[143]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[144]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0003_lp_open_surprise",Rate=0,Number=0,Bit=1)
DemoScripts[145]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0106_fx_Stand2Surprise",Rate=1,Number=2,Bit=0)
DemoScripts[146]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0600_lp_Surprise",Number=8)
DemoScripts[147]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_019_Cue',Name="エコロ")
DemoScripts[148]=(Actor=TEXT,Command=SET,ID=TEXT19)
DemoScripts[149]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[150]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0601_fx_Surprise2Stand",Rate=1,Number=2,Bit=0)
DemoScripts[151]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[152]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_020_Cue',Name="クロナ")
DemoScripts[153]=(Actor=TEXT,Command=SET,ID=TEXT20)
DemoScripts[154]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[155]=(Actor=CHARACTER,Command=PARAM,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',Number=4,Vec=(X=-280,Y=1150,Z=1320))
DemoScripts[156]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_021_Cue',Name="クロナ")
DemoScripts[157]=(Actor=TEXT,Command=SET,ID=TEXT21)
DemoScripts[158]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[159]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0103_fx_close_perplex",Rate=0,Number=0,Bit=0)
DemoScripts[160]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0001_fx_close_down",Rate=1,Number=1,Bit=0)
DemoScripts[161]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0107_fx_Stand2Perplex",Rate=1,Number=2,Bit=0)
DemoScripts[162]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0700_lp_Perplex",Number=8)
DemoScripts[163]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_022_Cue',Name="エコロ")
DemoScripts[164]=(Actor=TEXT,Command=SET,ID=TEXT22)
DemoScripts[165]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[166]=(Actor=CHARACTER,Command=PARAM,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',Number=12,Bit=0,Rate=0)
DemoScripts[167]=(Actor=CHARACTER,Command=PARAM,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Number=12,Bit=0,Rate=0)
DemoScripts[168]=(Actor=CHARACTER,Command=PARAM,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Number=13,Bit=0,Rate=1)
DemoScripts[169]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0003_lp_open_surprise",Rate=0,Number=0,Bit=1)
DemoScripts[170]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0100_fx_open_S",Rate=1,Number=1,Bit=0)
DemoScripts[171]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0701_fx_Perplex2Stand",Rate=1,Number=2,Bit=0)
DemoScripts[172]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[173]=(Actor=CAMERA,Command=SHAKE,ShakeLevel=LEVEL_2,SecTime=1)
DemoScripts[174]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_DM_Hug_Cue')
DemoScripts[175]=(Actor=CHARACTER,Command=MOVE,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',SetType=POS,Vec=(X=-476,Y=1105,Z=1145),SecTime=0.3,CId=21)
DemoScripts[176]=(Actor=SYSTEM,Command=WAIT,SecTime=0.3)
DemoScripts[177]=(Actor=CHARACTER,Command=SET,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',SetType=POS,Vec=(X=-476,Y=1105,Z=1145),CId=21)
DemoScripts[178]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_023_Cue',Name="アマツカ　パタコ")
DemoScripts[179]=(Actor=TEXT,Command=SET,ID=TEXT23)
DemoScripts[180]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[181]=(Actor=CHARACTER,Command=PARAM,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Number=13,Bit=0,Rate=0)
DemoScripts[182]=(Actor=CHARACTER,Command=MOVE,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',SetType=ROT,Vec=(X=165,Y=0,Z=0),SecTime=0.3,CId=71)
DemoScripts[183]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0103_fx_close_perplex",Rate=0,Number=0,Bit=0)
DemoScripts[184]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0001_fx_close_down",Rate=1,Number=1,Bit=0)
DemoScripts[185]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0103_fx_Stand2Furry",Rate=1,Number=2,Bit=0)
DemoScripts[186]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0300_lp_Furry",Number=8)
DemoScripts[187]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_024_Cue',Name="エコロ")
DemoScripts[188]=(Actor=TEXT,Command=SET,ID=TEXT24)
DemoScripts[189]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[190]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_025_Cue',Name="クロナ")
DemoScripts[191]=(Actor=TEXT,Command=SET,ID=TEXT25)
DemoScripts[192]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[193]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=8,Y=50,Z=0),SecTime=0.3)
DemoScripts[194]=(Actor=TEXT,Command=SET,ID=TEXT26)
DemoScripts[195]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_normal.GG2_V_Ekoro_End_normal_027_Cue',Name="アマツカ　パタコ")
DemoScripts[196]=(Actor=TEXT,Command=SET,ID=TEXT27)
DemoScripts[197]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[198]=(Actor=WINDOW,Command=EXIT)
DemoScripts[199]=(Actor=FADE,Command=SET,SecTime=2,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[200]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[201]=(Actor=AMBIENT,Command=STOP,SecTime=1,SoundID=)
DemoScripts[202]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[203]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[204]=(Actor=SYSTEM,Command=END)

[Select_Ekoro_End_normal_ENG GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Ekoro_End_normal_ENG GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大",Text="艾可蘿....../n太好了......妳恢復原狀了啊!")

Texts[1]=(Label="TEXT02",Name="艾可蘿",Text="嗚嗚......對不起,峯大大人./n給你添麻煩了.")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="帕塔可學姊也是,對不起....../n我......很不像樣吧......")

Texts[3]=(Label="TEXT04",Name="峯大",Text="艾可蘿......")

Texts[4]=(Label="TEXT05",Name="帕塔可",Text="別在意,艾可蘿./n艾可蘿能這麼掛念我,/n我覺得很高興哦.")

Texts[5]=(Label="TEXT06",Name="帕塔可",Text="呼--/n雖然結果平平,但這樣就能放心了呢./n太好了......")

Texts[6]=(Label="TEXT07",Name="艾可蘿",Text="咦?/n這麼說來,帕塔可學姊....../n妳沒問題嗎?")

Texts[7]=(Label="TEXT08",Name="艾可蘿",Text="現在的帕塔可學姊難道不是/n失去了身為天使的力量,所以處於/n會受峯大大人受歡迎氣場影響的狀態嗎?")

Texts[8]=(Label="TEXT09",Name="帕塔可",Text="啊--那件事啊?")

Texts[9]=(Label="TEXT10",Name="帕塔可",Text="的確是這樣沒錯,/n不過該說是靠著擔心艾可蘿的心情/n硬是壓制住了嗎......")

Texts[10]=(Label="TEXT11",Name="艾可蘿",Text="帕塔可學姊......竟然對我這麼......")

Texts[11]=(Label="TEXT12",Name="帕塔可",Text="所以說,已經沒了這份擔憂的現在....../n呵呵呵呵呵......!")

Texts[12]=(Label="TEXT13",Name="艾可蘿",Text="帕塔可學姊......?")

Texts[13]=(Label="TEXT14",Name="帕塔可",Text="峯大學長!/n帕塔可已經迷上你了--!")

Texts[14]=(Label="TEXT15",Name="峯大",Text="唔咕!!")

Texts[15]=(Label="TEXT16",Name="艾可蘿",Text="帕......帕塔可學姊!/n振作點!/n請離開那個男人!!")

Texts[16]=(Label="TEXT17",Name="艾可蘿",Text="啊......對了! 庫蘿娜!/n快點用槍刺峯大大人!/n這樣一來就全部解決......")

Texts[17]=(Label="TEXT18",Name="庫蘿娜",Text="嚕嚕嚕......")

Texts[18]=(Label="TEXT19",Name="艾可蘿",Text="啥!?/n妳在遠望什麼啊!")

Texts[19]=(Label="TEXT20",Name="庫蘿娜",Text="從剛才開始,庫蘿娜就一直被排擠在外....../n沒關係DEATH,沒關係DEATH....../n反正庫蘿娜就是沒人要的孩子DEATH啦......")

Texts[20]=(Label="TEXT21",Name="庫蘿娜",Text="反正艾可蘿也已經忘記/n庫蘿娜的事了DEATH吧....../n哭哭......")

Texts[21]=(Label="TEXT22",Name="艾可蘿",Text="請振作一點啊--!!")

Texts[22]=(Label="TEXT23",Name="帕塔可",Text="峯大學長~!/n一起來玩生存遊戲吧!")

Texts[23]=(Label="TEXT24",Name="艾可蘿",Text="哇!/n這邊也是--!!")

Texts[24]=(Label="TEXT25",Name="庫蘿娜",Text="嚕嚕嚕......")

Texts[25]=(Label="TEXT26",Name="峯大",Text="誰來想點辦法啊---!!")

Texts[26]=(Label="TEXT27",Name="帕塔可",Text="啊~嗯!/n峯大學長~!/n不要這樣嘛~!!")

Texts[27]=(Label="",Name="",Text="")

Texts[28]=(Label="SELECT01",Name="",Text="")

Texts[29]=(Label="SELECT02",Name="",Text="")

Texts[30]=(Label="SELECT03",Name="",Text="")

Texts[31]=(Label="SELECT04",Name="",Text="")

Texts[32]=(Label="SELECT05",Name="",Text="")

Texts[33]=(Label="SELECT06",Name="",Text="")

Texts[34]=(Label="SELECT07",Name="",Text="")

Texts[35]=(Label="SELECT08",Name="",Text="")

Texts[36]=(Label="SELECT09",Name="",Text="")

Texts[37]=(Label="SELECT10",Name="",Text="")


